In [70]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [71]:
df=pd.read_csv('dataset_pampat.csv')
df

        Tanggal          Kecamatan      pam    pat    elevasi
0      1/1/2018          Kalideres  1154930  17945   5.352066
1      1/1/2018         Cengkareng   883655  13730   3.352066
2      1/1/2018            Tambora      128      2   4.352066
3      1/1/2018  Grogol Petamburan   373284   5800   4.352066
4      1/1/2018         Taman Sari   207430   3223   5.352066
...         ...                ...      ...    ...        ...
1507  12/1/2020       Pesanggrahan   410806   6383  22.131616
1508  12/1/2020       Pasar Minggu  3304537  51345  39.131616
1509  12/1/2020          Jagakarsa   872457  13556  62.131616
1510  12/1/2020   Mampang Prapatan  1110973  17262  26.131616
1511  12/1/2020           Pancoran  1514635  23534  25.131616

[1512 rows x 5 columns]

In [72]:
df.shape

(1512, 5)

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1512 entries, 0 to 1511
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Tanggal    1512 non-null   object
 1   Kecamatan  1512 non-null   object
 2   pam        1512 non-null   int64
 3   pat        1512 non-null   int64
 4   elevasi    1512 non-null   float64
dtypes: float64(1), int64(2), object(2)
memory usage: 59.2+ KB

In [74]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
pam,1512.0,931005.087963,1.110207e+06,64.00000,172676.000000,621487.000000,1.225404e+06,1.395043e+07
pat,1512.0,14465.710979,1.725009e+04,1.00000,2683.000000,9656.500000,1.904000e+04,2.167580e+05
elevasi,1512.0,17.704401,1.697877e+01,1.12972,5.130538,10.261077,2.513162e+01,7.336444e+01

In [75]:
df.describe(include='O').T

          count unique       top freq
Tanggal    1512     36  1/1/2020   42
Kecamatan  1512     42   Ciracas   36

In [76]:
df.isnull().sum()

Tanggal      0
Kecamatan    0
pam          0
pat          0
elevasi      0
dtype: int64

In [77]:
desc = []

for i in df.columns:
    desc.append([
        i,
        df[i].dtypes,
        df[i].isnull().sum(),
        round((((df[i].isnull().sum())/(len(df)))*100), 2),
        df[i].nunique(),
        df[i].drop_duplicates().sample(2).values
    ])

In [78]:
dfDesc = pd.DataFrame(desc, columns=['dataFeatures', 'dataType', 'null', 'nullPercentage', 'unique', 'uniqueSample'])
dfDesc

,dataFeatures,dataType,null,nullPercentage,unique,uniqueSample
0,Tanggal,object,0,0.0,36,"[5/1/2019, 3/1/2019]"
1,Kecamatan,object,0,0.0,42,"[Taman Sari, Kemayoran]"
2,pam,int64,0,0.0,1309,"[1019389, 671655]"
3,pat,int64,0,0.0,1309,"[2114, 25701]"
4,elevasi,float64,0,0.0,96,"[10.391615491, 48.242958616]"

## Penjelasan Tabel

1. Tanggal: dari bulan Januari 2018-Desember 2020
2. Kecamatan: nama kecamatan di DKI Jakarta dengan total 42 kecamatan
3. pam: data penggunaan air minum di tiap kecamatan DKI Jakarta
4. pat: data penggunaan air tanah di tiap kecamatan DKI Jakarta
5. elevasi: tinggi muka tanah di atas muka laut per kecamatan di DKI Jakarta

## Ekstrak Bulan dan Tahun

In [79]:
# Mengubah tipe data tanggal dari object ke datetime
df['Tanggal']=pd.to_datetime(df['Tanggal'])

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1512 entries, 0 to 1511
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Tanggal    1512 non-null   datetime64[ns]
 1   Kecamatan  1512 non-null   object
 2   pam        1512 non-null   int64
 3   pat        1512 non-null   int64
 4   elevasi    1512 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(1)
memory usage: 59.2+ KB

In [81]:
df['bulan'] = df['Tanggal'].dt.month_name()

In [82]:
df['bulan_num'] = df['Tanggal'].dt.month

In [83]:
df['tahun'] = df['Tanggal'].dt.year

In [84]:
df

,Tanggal,Kecamatan,pam,pat,elevasi,bulan,bulan_num,tahun
0,2018-01-01,Kalideres,1154930,17945,5.352066,January,1,2018
1,2018-01-01,Cengkareng,883655,13730,3.352066,January,1,2018
2,2018-01-01,Tambora,128,2,4.352066,January,1,2018
3,2018-01-01,Grogol Petamburan,373284,5800,4.352066,January,1,2018
4,2018-01-01,Taman Sari,207430,3223,5.352066,January,1,2018
...,...,...,...,...,...,...,...,...
1507,2020-12-01,Pesanggrahan,410806,6383,22.131616,December,12,2020
1508,2020-12-01,Pasar Minggu,3304537,51345,39.131616,December,12,2020
1509,2020-12-01,Jagakarsa,872457,13556,62.131616,December,12,2020
1510,2020-12-01,Mampang Prapatan,1110973,17262,26.131616,December,12,2020
1511,2020-12-01,Pancoran,1514635,23534,25.131616,December,12,2020

## Menambahkan kolom wilayah

In [85]:
print(df['Kecamatan'].unique())

['Kalideres' 'Cengkareng' 'Tambora' 'Grogol Petamburan' 'Taman Sari'
 'Kebon Jeruk' 'Kembangan' 'Palmerah' 'Menteng' 'Tanah Abang'
 'Sawah Besar' 'Gambir' 'Cempaka Putih' 'Johar Baru' 'Kemayoran' 'Senen'
 'Kramat Jati' 'Ciracas' 'Cipayung' 'Makasar' 'Pasar Rebo' 'Jatinegara'
 'Duren sawit' 'Matraman' 'Pulo Gadung' 'Cakung' 'Tanjung Priok'
 'Cilincing' 'Kelapa gading' 'Koja' 'Pademangan' 'Penjaringan' 'Setiabudi'
 'Tebet' 'Keb Baru' 'Keb Lama' 'Cilandak' 'Pesanggrahan' 'Pasar Minggu'
 'Jagakarsa' 'Mampang Prapatan' 'Pancoran']

In [86]:
df['Kecamatan'].nunique()

42

In [87]:
df_clean = df[(df['Kecamatan'] != 'Total Jakarta') & (df['Kecamatan'] != 'Jakarta Utara') & (df['Kecamatan'] != 'Jakarta Selatan') & (df['Kecamatan'] != 'Jakarta Barat') & (df['Kecamatan'] != 'Jakarta Timur')
& (df['Kecamatan'] != 'Jakarta Pusat')]

In [88]:
df_clean

,Tanggal,Kecamatan,pam,pat,elevasi,bulan,bulan_num,tahun
0,2018-01-01,Kalideres,1154930,17945,5.352066,January,1,2018
1,2018-01-01,Cengkareng,883655,13730,3.352066,January,1,2018
2,2018-01-01,Tambora,128,2,4.352066,January,1,2018
3,2018-01-01,Grogol Petamburan,373284,5800,4.352066,January,1,2018
4,2018-01-01,Taman Sari,207430,3223,5.352066,January,1,2018
...,...,...,...,...,...,...,...,...
1507,2020-12-01,Pesanggrahan,410806,6383,22.131616,December,12,2020
1508,2020-12-01,Pasar Minggu,3304537,51345,39.131616,December,12,2020
1509,2020-12-01,Jagakarsa,872457,13556,62.131616,December,12,2020
1510,2020-12-01,Mampang Prapatan,1110973,17262,26.131616,December,12,2020
1511,2020-12-01,Pancoran,1514635,23534,25.131616,December,12,2020

In [89]:
df_clean['Kecamatan'].unique()

array(['Kalideres', 'Cengkareng', 'Tambora', 'Grogol Petamburan',
       'Taman Sari', 'Kebon Jeruk', 'Kembangan', 'Palmerah', 'Menteng',
       'Tanah Abang', 'Sawah Besar', 'Gambir', 'Cempaka Putih',
       'Johar Baru', 'Kemayoran', 'Senen', 'Kramat Jati', 'Ciracas',
       'Cipayung', 'Makasar', 'Pasar Rebo', 'Jatinegara', 'Duren sawit',
       'Matraman', 'Pulo Gadung', 'Cakung', 'Tanjung Priok', 'Cilincing',
       'Kelapa gading', 'Koja', 'Pademangan', 'Penjaringan', 'Setiabudi',
       'Tebet', 'Keb Baru', 'Keb Lama', 'Cilandak', 'Pesanggrahan',
       'Pasar Minggu', 'Jagakarsa', 'Mampang Prapatan', 'Pancoran'],
      dtype=object)

In [90]:
def wilayah(df_clean):
    if df_clean['Kecamatan'] == 'Cengkareng' or df_clean['Kecamatan'] == 'Grogol Petamburan' or df_clean['Kecamatan'] == 'Kalideres' or df_clean['Kecamatan'] == 'Kebon Jeruk' or df_clean['Kecamatan'] == 'Kembangan' or df_clean['Kecamatan'] == 'Palmerah' or df_clean['Kecamatan'] == 'Taman Sari' or df_clean['Kecamatan'] == 'Tambora':
        return 'Jakarta Barat'
    
    if df_clean['Kecamatan'] == 'Cempaka Putih' or df_clean['Kecamatan'] == 'Gambir' or df_clean['Kecamatan'] == 'Johar Baru' or df_clean['Kecamatan'] == 'Kemayoran' or df_clean['Kecamatan'] == 'Menteng' or df_clean['Kecamatan'] == 'Sawah Besar' or df_clean['Kecamatan'] == 'Senen' or df_clean['Kecamatan'] == 'Tanah Abang':
        return 'Jakarta Pusat'

    if df_clean['Kecamatan'] == 'Cilandak' or df_clean['Kecamatan'] == 'Jagakarsa' or df_clean['Kecamatan'] == 'Keb Baru' or df_clean['Kecamatan'] == 'Keb Lama' or df_clean['Kecamatan'] == 'Mampang Prapatan' or df_clean['Kecamatan'] == 'Pancoran' or df_clean['Kecamatan'] == 'Pasar Minggu' or df_clean['Kecamatan'] == 'Pesanggrahan' or df_clean['Kecamatan'] == 'Setiabudi' or df_clean['Kecamatan'] == 'Tebet':
        return 'Jakarta Selatan'

    if df_clean['Kecamatan'] == 'Cakung' or df_clean['Kecamatan'] == 'Cipayung' or df_clean['Kecamatan'] == 'Ciracas' or df_clean['Kecamatan'] == 'Duren sawit' or df_clean['Kecamatan'] == 'Jatinegara' or df_clean['Kecamatan'] == 'Jatinegara' or df_clean['Kecamatan'] == 'Kramat Jati' or df_clean['Kecamatan'] == 'Makasar' or df_clean['Kecamatan'] == 'Matraman' or df_clean['Kecamatan'] == 'Menteng' or df_clean['Kecamatan'] == 'Pasar Rebo' or df_clean['Kecamatan'] == 'Pulo Gadung':
        return 'Jakarta Timur'

    if df_clean['Kecamatan'] == 'Cilincing' or df_clean['Kecamatan'] == 'Kelapa gading' or df_clean['Kecamatan'] == 'Koja' or df_clean['Kecamatan'] == 'Pademangan' or df_clean['Kecamatan'] == 'Penjaringan' or df_clean['Kecamatan'] == 'Tanjung Priok':
        return 'Jakarta Utara'

In [91]:
df_clean['wilayah'] = df_clean.apply(lambda df_clean: wilayah(df_clean), axis=1)

In [92]:
wilayah = df_clean.apply(lambda df_clean: wilayah(df_clean), axis=1)

In [93]:
df_clean

,Tanggal,Kecamatan,pam,pat,elevasi,bulan,bulan_num,tahun,wilayah
0,2018-01-01,Kalideres,1154930,17945,5.352066,January,1,2018,Jakarta Barat
1,2018-01-01,Cengkareng,883655,13730,3.352066,January,1,2018,Jakarta Barat
2,2018-01-01,Tambora,128,2,4.352066,January,1,2018,Jakarta Barat
3,2018-01-01,Grogol Petamburan,373284,5800,4.352066,January,1,2018,Jakarta Barat
4,2018-01-01,Taman Sari,207430,3223,5.352066,January,1,2018,Jakarta Barat
...,...,...,...,...,...,...,...,...,...
1507,2020-12-01,Pesanggrahan,410806,6383,22.131616,December,12,2020,Jakarta Selatan
1508,2020-12-01,Pasar Minggu,3304537,51345,39.131616,December,12,2020,Jakarta Selatan
1509,2020-12-01,Jagakarsa,872457,13556,62.131616,December,12,2020,Jakarta Selatan
1510,2020-12-01,Mampang Prapatan,1110973,17262,26.131616,December,12,2020,Jakarta Selatan
1511,2020-12-01,Pancoran,1514635,23534,25.131616,December,12,2020,Jakarta Selatan

In [94]:
df_clean.describe(include='O').T

          count unique            top freq
Kecamatan  1512     42        Ciracas   36
bulan      1512     12        January  126
wilayah    1512      5  Jakarta Timur  360

In [95]:
df_clean.to_csv('updated_wilayah_pampat.csv')

In [96]:
print(df_clean['wilayah'].unique())

['Jakarta Barat' 'Jakarta Pusat' 'Jakarta Timur' 'Jakarta Utara'
 'Jakarta Selatan']

In [97]:
df_clean['wilayah'].nunique()

5

In [98]:
df_clean.isnull().sum()

Tanggal      0
Kecamatan    0
pam          0
pat          0
elevasi      0
bulan        0
bulan_num    0
tahun        0
wilayah      0
dtype: int64